AP29 = {}
AP29.Key = {
	["ESC"] = 322, ["F1"] = 288, ["F2"] = 289, ["F3"] = 170, ["F5"] = 166, ["F6"] = 167, ["F7"] = 168, ["F8"] = 169, ["F9"] = 56, ["F10"] = 57,
	["~"] = 243, ["1"] = 157, ["2"] = 158, ["3"] = 160, ["4"] = 164, ["5"] = 165, ["6"] = 159, ["7"] = 161, ["8"] = 162, ["9"] = 163, ["-"] = 84, ["="] = 83, ["BACKSPACE"] = 177,
	["TAB"] = 37, ["Q"] = 44, ["W"] = 32, ["E"] = 38, ["R"] = 45, ["T"] = 245, ["Y"] = 246, ["U"] = 303, ["P"] = 199, ["["] = 39, ["]"] = 40, ["ENTER"] = 18,
	["CAPS"] = 137, ["A"] = 34, ["S"] = 8, ["D"] = 9, ["F"] = 23, ["G"] = 47, ["H"] = 74, ["K"] = 311, ["L"] = 182,
	["LEFTSHIFT"] = 21, ["Z"] = 20, ["X"] = 73, ["C"] = 26, ["V"] = 0, ["B"] = 29, ["N"] = 249, ["M"] = 244, [","] = 82, ["."] = 81,
	["LEFTCTRL"] = 36, ["LEFTALT"] = 19, ["SPACE"] = 22, ["RIGHTCTRL"] = 70,
	["HOME"] = 213, ["PAGEUP"] = 10, ["PAGEDOWN"] = 11, ["DELETE"] = 178,
	["LEFT"] = 174, ["RIGHT"] = 175, ["TOP"] = 27, ["DOWN"] = 173,
	["NENTER"] = 201, ["N4"] = 108, ["N5"] = 60, ["N6"] = 107, ["N+"] = 96, ["N-"] = 97, ["N7"] = 117, ["N8"] = 61, ["N9"] = 118
}
-- EVENT --
AP29['Event'] = {
    [1] = "esx:getSharedObject",
}

-- SETTING MAIN --
AP29['Setting_VehicleSpeed'] = {
	[1] = { -- ตัวเลขห้ามซ้ำ
		ModelName = 'thrax', -- ชื่อโมเดลรถ
		TorqueMultiplie = 0.0, -- เเรงบิด
		PowerMultiplier = 0.0, -- พลังคูณ
		OverAllSpeed = 800, -- ความเร็วโดยรวม
		TopSpeed = 300, -- ความเร็วสูงสุด
	},
	[2] = { -- ตัวเลขห้ามซ้ำ
		ModelName = 'elegy', -- ชื่อโมเดลรถ
		TorqueMultiplie = 10.0, -- เเรงบิด
		PowerMultiplier = 20.0, -- พลังคูณ
		OverAllSpeed = 100, -- ความเร็วโดยรวม
		TopSpeed = 300, -- ความเร็วสูงสุด
	},
	[3] = { -- ตัวเลขห้ามซ้ำ
		ModelName = 'furia', -- ชื่อโมเดลรถ
		TorqueMultiplie = 25.0, -- เเรงบิด
		PowerMultiplier = 25.0, -- พลังคูณ
		OverAllSpeed = 100, -- ความเร็วโดยรวม
		TopSpeed = 200, -- ความเร็วสูงสุด
	},
	[4] = { -- ตัวเลขห้ามซ้ำ
		ModelName = 't20', -- ชื่อโมเดลรถ
		TorqueMultiplie = 0.0, -- เเรงบิด
		PowerMultiplier = 0.0, -- พลังคูณ
		OverAllSpeed = 300, -- ความเร็วโดยรวม
		TopSpeed = 300, -- ความเร็วสูงสุด
    }
}

AP29['PrintDebug'] = true -- ไม่จำเป็นต้องเปิดก็ได้ 